docs: updatte READme.md, create ARCHITECTURE.md, add LICENSE
